{"id":18,"date":"2021-05-27T21:01:26","date_gmt":"2021-05-27T21:01:26","guid":{"rendered":"http:\/\/makanakainvestments.github.io\/?page_id=18"},"modified":"2021-06-04T09:26:18","modified_gmt":"2021-06-04T09:26:18","slug":"community-responsibility","status":"publish","type":"page","link":"http:\/\/makanakainvestments.github.io\/community-responsibility\/","title":{"rendered":"Community Responsibility &#038; Environment"},"content":{"rendered":"\n\n\n\n<p class=\"has-drop-cap\">As a company and as individuals, we take great pride in contributing to the communities where we live and work. Makanaka Investments (Pvt) Ltd has come to realize the importance of the support it receives from the local community and has reciprocated that by ploughing back.<\/p>\n\n\n\n<p>The company has been supplying equipment to schools and other organisations in Chivi and Zvishavane district since 2011.<\/p>\n\n\n\n<p>The company has been donating building materials generously to churches and other community based organizations involved in construction projects. The company has also been sponsoring soccer tournaments in schools in Mberengwa, Chivi, Zvishavane and Runde districts and a number of schools received sports kits.<\/p>\n\n\n\n<p>Several boreholes have been drilled around Zvishavane and in the Chivi district to help alleviate the water crisis that has been experienced in the communities.<\/p>\n\n\n\n<p>We offer credit facilities to approved customers on favourable payment terms in our bid not to leave anyone behind as we grow in business.<\/p>\n\n\n\n<p>We also care about the environment and are proud of the many ways in which our employees work to safeguard it. Our persistent efforts to improve on our safe working environment continue to pay off. Since 2011, Makanaka Investments has been achieving safest environments ever, setting new safety records in the days, away from work performance in all our operations. The company recorded no accidents in its haulage business and no staff member was involved in any accident at work throughout the period.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a company and as individuals, we take great pride in contributing to the communities where we live and work. Makanaka Investments (Pvt) Ltd has come to realize the importance of the support it receives from the local community and has reciprocated that by ploughing back. The company has been supplying equipment to schools and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/template-full-width.php","meta":[],"featured_image_urls":{"full":"","thumbnail":"","medium":"","medium_large":"","large":"","1536x1536":"","2048x2048":"","post-thumbnail":"","twentytwenty-fullscreen":""},"post_excerpt_stackable":"<p>As a company and as individuals, we take great pride in contributing to the communities where we live and work. Makanaka Investments (Pvt) Ltd has come to realize the importance of the support it receives from the local community and has reciprocated that by ploughing back. The company has been supplying equipment to schools and other organisations in Chivi and Zvishavane district since 2011. The company has been donating building materials generously to churches and other community based organizations involved in construction projects. The company has also been sponsoring soccer tournaments in schools in Mberengwa, Chivi, Zvishavane and Runde districts&hellip;<\/p>\n","category_list":"","author_info":{"name":"admin","url":"http:\/\/makanakainvestments.github.io\/author\/admin\/"},"comments_num":"0 comments","_links":{"self":[{"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/pages\/18"}],"collection":[{"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/comments?post=18"}],"version-history":[{"count":5,"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/pages\/18\/revisions"}],"predecessor-version":[{"id":283,"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/pages\/18\/revisions\/283"}],"wp:attachment":[{"href":"http:\/\/makanakainvestments.github.io\/wp-json\/wp\/v2\/media?parent=18"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}